In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/amazon_fires.csv',encoding='ISO-8859-1')
df

       ano       mes     estado   numero  encontro
0     1998   Janeiro       Acre  0 Fires  1/1/1998
1     1999   Janeiro       Acre  0 Fires  1/1/1999
2     2000   Janeiro       Acre  0 Fires  1/1/2000
3     2001   Janeiro       Acre  0 Fires  1/1/2001
4     2002   Janeiro       Acre  0 Fires  1/1/2002
...    ...       ...        ...      ...       ...
6449  2012  Dezembro  Tocantins      128  1/1/2012
6450  2013  Dezembro  Tocantins       85  1/1/2013
6451  2014  Dezembro  Tocantins      223  1/1/2014
6452  2015  Dezembro  Tocantins      373  1/1/2015
6453  2016  Dezembro  Tocantins      119  1/1/2016

[6454 rows x 5 columns]

In [3]:
df.info

<bound method DataFrame.info of        ano       mes     estado   numero  encontro
0     1998   Janeiro       Acre  0 Fires  1/1/1998
1     1999   Janeiro       Acre  0 Fires  1/1/1999
2     2000   Janeiro       Acre  0 Fires  1/1/2000
3     2001   Janeiro       Acre  0 Fires  1/1/2001
4     2002   Janeiro       Acre  0 Fires  1/1/2002
...    ...       ...        ...      ...       ...
6449  2012  Dezembro  Tocantins      128  1/1/2012
6450  2013  Dezembro  Tocantins       85  1/1/2013
6451  2014  Dezembro  Tocantins      223  1/1/2014
6452  2015  Dezembro  Tocantins      373  1/1/2015
6453  2016  Dezembro  Tocantins      119  1/1/2016

[6454 rows x 5 columns]>

# Joins - 
- If we want to fetch the data from to diffrent table s
- 1. inner join
  2. left join
  3. right join
  4. outer join

* inner join:-  it return only matching records from both the tables.

* outer join:-  It will returns all the record from both data frame.

# syntax:-
  pd.merge(var1,var2,on='common_col',how='inner/left')

In [5]:
pd.merge(df1,df,on='dept_no',how='inner')

NameError: name 'df1' is not defined

# Feature engineering:-  It is a process of create a new column based on existing column.

* syntax :-
*    var[col]=new_valve

In [6]:
df1 = pd.read_csv("https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/titanic.csv")
df1

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0

In [7]:
df1['family_count_without'] = df1['sibsp']+df1['parch']
df1['family_count_with'] = df1['sibsp']+df1['parch']+1
df1

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived,family_count_without,family_count_with
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1,0,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1,3,4
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0,3,4
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0,3,4
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0,3,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0,1,2
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0,1,2
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0,0,1
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0,0,1
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0,0,1

In [8]:
out = []
for i in df1['name']:
        out.append(i.split(',')[0])
df1['family_name_for'] = out
df1

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived,family_count_without,family_count_with,family_name_for
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1,0,1,Allen
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1,3,4,Allison
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0,3,4,Allison
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0,3,4,Allison
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0,3,4,Allison
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0,1,2,Zabour
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0,1,2,Zabour
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0,0,1,Zakarian
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0,0,1,Zakarian
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0,0,1,Zimmerman

In [9]:
df1['title'] = df1['name'].str.split('.').str[0].str.split(',').str[1]
df1

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived,family_count_without,family_count_with,family_name_for,title
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1,0,1,Allen,Miss
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1,3,4,Allison,Master
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0,3,4,Allison,Miss
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0,3,4,Allison,Mr
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0,3,4,Allison,Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0,1,2,Zabour,Miss
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0,1,2,Zabour,Miss
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0,0,1,Zakarian,Mr
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0,0,1,Zakarian,Mr
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0,0,1,Zimmerman,Mr

# Pivot table:-


* syntax  :-    df.pivot_table(values=['col1','col2'......'coln'],
*                      index='categorical_column',
*                      )

In [10]:
df1

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived,family_count_without,family_count_with,family_name_for,title
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1,0,1,Allen,Miss
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1,3,4,Allison,Master
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0,3,4,Allison,Miss
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0,3,4,Allison,Mr
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0,3,4,Allison,Mrs
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,0,1,2,Zabour,Miss
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,0,1,2,Zabour,Miss
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,0,0,1,Zakarian,Mr
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,0,0,1,Zakarian,Mr
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,0,0,1,Zimmerman,Mr

In [11]:
df1.pivot_table(values=['age','fare'],
                index='sex',
                aggfunc=['mean','count'])

             mean            count
              age       fare   age fare
sex
female  28.687071  46.198097   388  466
male    30.585233  26.154601   658  842

In [12]:
df1[df1['sex']=='female']['age'].count()

np.int64(388)

In [13]:
df1 = pd.read_csv("https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/hr_data.csv")
df1

,employee_id,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,department,salary
0,1003,2,157,3,0,1,0,sales,low
1,1005,5,262,6,0,1,0,sales,medium
2,1486,7,272,4,0,1,0,sales,medium
3,1038,5,223,5,0,1,0,sales,low
4,1057,2,159,3,0,1,0,sales,low
...,...,...,...,...,...,...,...,...,...
14994,87670,2,151,3,0,1,0,support,low
14995,87673,2,160,3,0,1,0,support,low
14996,87679,2,143,3,0,1,0,support,low
14997,87681,6,280,4,0,1,0,support,low
14998,87684,2,158,3,0,1,0,support,low

In [14]:
df1.pivot_table(values=['number_project'],
                index='department',
                aggfunc=['sum'])

                       sum
            number_project
department
IT                    4683
RandD                 3033
accounting            2934
hr                    2701
management            2432
marketing             3164
product_mng           3434
sales                15634
support               8479
technical            10548

In [15]:
df1.pivot_table(values=['employee_id'],
                index='left',
                aggfunc=['count'])

           count
     employee_id
left
0          11428
1           3571

In [16]:
pd.date_range(start='01/09/2026',end='12/31/2029',freq='D')

DatetimeIndex(['2026-01-09', '2026-01-10', '2026-01-11', '2026-01-12',
               '2026-01-13', '2026-01-14', '2026-01-15', '2026-01-16',
               '2026-01-17', '2026-01-18',
               ...
               '2029-12-22', '2029-12-23', '2029-12-24', '2029-12-25',
               '2029-12-26', '2029-12-27', '2029-12-28', '2029-12-29',
               '2029-12-30', '2029-12-31'],
              dtype='datetime64[ns]', length=1453, freq='D')

In [17]:
pd.date_range(start='01/09/2026',end='12/31/2029',freq='B')

DatetimeIndex(['2026-01-09', '2026-01-12', '2026-01-13', '2026-01-14',
               '2026-01-15', '2026-01-16', '2026-01-19', '2026-01-20',
               '2026-01-21', '2026-01-22',
               ...
               '2029-12-18', '2029-12-19', '2029-12-20', '2029-12-21',
               '2029-12-24', '2029-12-25', '2029-12-26', '2029-12-27',
               '2029-12-28', '2029-12-31'],
              dtype='datetime64[ns]', length=1037, freq='B')

In [18]:
pd.date_range(start='01/09/2026',end='12/31/2029',freq='MS')  #  month start

DatetimeIndex(['2026-02-01', '2026-03-01', '2026-04-01', '2026-05-01',
               '2026-06-01', '2026-07-01', '2026-08-01', '2026-09-01',
               '2026-10-01', '2026-11-01', '2026-12-01', '2027-01-01',
               '2027-02-01', '2027-03-01', '2027-04-01', '2027-05-01',
               '2027-06-01', '2027-07-01', '2027-08-01', '2027-09-01',
               '2027-10-01', '2027-11-01', '2027-12-01', '2028-01-01',
               '2028-02-01', '2028-03-01', '2028-04-01', '2028-05-01',
               '2028-06-01', '2028-07-01', '2028-08-01', '2028-09-01',
               '2028-10-01', '2028-11-01', '2028-12-01', '2029-01-01',
               '2029-02-01', '2029-03-01', '2029-04-01', '2029-05-01',
               '2029-06-01', '2029-07-01', '2029-08-01', '2029-09-01',
               '2029-10-01', '2029-11-01', '2029-12-01'],
              dtype='datetime64[ns]', freq='MS')

In [19]:
pd.date_range(start='01/09/2026',end='12/31/2029',freq='W')

DatetimeIndex(['2026-01-11', '2026-01-18', '2026-01-25', '2026-02-01',
               '2026-02-08', '2026-02-15', '2026-02-22', '2026-03-01',
               '2026-03-08', '2026-03-15',
               ...
               '2029-10-28', '2029-11-04', '2029-11-11', '2029-11-18',
               '2029-11-25', '2029-12-02', '2029-12-09', '2029-12-16',
               '2029-12-23', '2029-12-30'],
              dtype='datetime64[ns]', length=208, freq='W-SUN')

In [20]:
pd.date_range(start='01/09/2026',end='12/31/2029',freq='ME')  #  Month end

DatetimeIndex(['2026-01-31', '2026-02-28', '2026-03-31', '2026-04-30',
               '2026-05-31', '2026-06-30', '2026-07-31', '2026-08-31',
               '2026-09-30', '2026-10-31', '2026-11-30', '2026-12-31',
               '2027-01-31', '2027-02-28', '2027-03-31', '2027-04-30',
               '2027-05-31', '2027-06-30', '2027-07-31', '2027-08-31',
               '2027-09-30', '2027-10-31', '2027-11-30', '2027-12-31',
               '2028-01-31', '2028-02-29', '2028-03-31', '2028-04-30',
               '2028-05-31', '2028-06-30', '2028-07-31', '2028-08-31',
               '2028-09-30', '2028-10-31', '2028-11-30', '2028-12-31',
               '2029-01-31', '2029-02-28', '2029-03-31', '2029-04-30',
               '2029-05-31', '2029-06-30', '2029-07-31', '2029-08-31',
               '2029-09-30', '2029-10-31', '2029-11-30', '2029-12-31'],
              dtype='datetime64[ns]', freq='ME')

In [21]:
pd.date_range(start='01/09/2026',end='12/31/2029',freq='YS')  # Year start

DatetimeIndex(['2027-01-01', '2028-01-01', '2029-01-01'], dtype='datetime64[ns]', freq='YS-JAN')

In [22]:
pd.date_range(start='01/09/2026',end='12/31/2029',freq='YE')  # Year end

DatetimeIndex(['2026-12-31', '2027-12-31', '2028-12-31', '2029-12-31'], dtype='datetime64[ns]', freq='YE-DEC')

In [23]:
pd.date_range(start='01/09/2026',end='12/31/2029',freq='YS-FEB')

DatetimeIndex(['2026-02-01', '2027-02-01', '2028-02-01', '2029-02-01'], dtype='datetime64[ns]', freq='YS-FEB')

In [24]:
pd.date_range(start='01/09/2026',end='12/31/2029',freq='YE-DEC')

DatetimeIndex(['2026-12-31', '2027-12-31', '2028-12-31', '2029-12-31'], dtype='datetime64[ns]', freq='YE-DEC')

In [25]:
pd.date_range(start='01/09/2026',end='12/31/2029',freq='2D')

DatetimeIndex(['2026-01-09', '2026-01-11', '2026-01-13', '2026-01-15',
               '2026-01-17', '2026-01-19', '2026-01-21', '2026-01-23',
               '2026-01-25', '2026-01-27',
               ...
               '2029-12-13', '2029-12-15', '2029-12-17', '2029-12-19',
               '2029-12-21', '2029-12-23', '2029-12-25', '2029-12-27',
               '2029-12-29', '2029-12-31'],
              dtype='datetime64[ns]', length=727, freq='2D')